tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

# Programming languages related
brew "fnm"
brew "lua"
brew "ruby"
brew "rbenv"
brew "chruby"
brew "ruby-install"
brew "python3"
brew "pipenv"
brew "pyenv"
brew "php@7.4", link: true, conflicts_with: ["php"]
brew "composer"
brew "node"
brew "go"
brew "rust"
brew "k9s"
brew "kubefwd"
brew "android-studio"
# brew "kotlin"
# brew "scala"
# brew "sbt"
# brew "svn"

# AWS releated
brew "awscli"
# brew "s3cmd"

brew "ag"
brew "autojump"
brew "asciinema"
brew "bash"
brew "bat"
brew "gettext"
brew "gpg"
# brew "carthage"
brew "caddy"
brew "cocoapods"
brew "coreutils"
brew "checkbashisms"
brew "diff-so-fancy"
brew "exa"
brew "fd"
brew "fzf"
brew "fortune"
brew "fastlane"
brew "git"
brew "git-extras"
brew "gnupg"
brew "graphviz"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "jid"
brew "kubernetes-cli"
brew "nmap"
brew "ncdu"
brew "openssl"
brew "scmpuff"
# brew "shellcheck"
brew "streamlink"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh-completions"
brew "php-cs-fixer"

# Font
cask "font-pt-mono"
cask "font-source-code-pro"

# Applications
cask_args appdir: "/Applications"
cask "dropbox"
cask "docker"
cask "firefox"
cask "figma"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "iterm2"
cask "iina"
cask "insomnia"
cask "notion"
cask "postman"
cask "raycast"
cask "slite"
cask "skype"
cask "slack"
cask "sf-symbols"
cask "tableplus"
cask "the-unarchiver"
cask "homebrew/cask-versions/google-chrome-canary"
cask "visual-studio-code"
