tap "homebrew/bundle"
tap "homebrew/cask-versions"

# Programming languages related
brew "lua"
brew "ruby"
brew "python3"
brew "pipenv"
brew "php"
brew "composer"
brew "node"
brew "go"
brew "rust"
brew "kotlin"
brew "scala"
brew "sbt"

# AWS releated
brew "awscli"
brew "s3cmd"

brew "ack"
brew "autojump"
brew "asciinema"
brew "bash"
brew "bat"
brew "gettext"
brew "carthage"
brew "ccat"
brew "cocoapods"
brew "coreutils"
brew "checkbashisms"
brew "diff-so-fancy"
brew "exa"
brew "fzf"
brew "fortune"
brew "fastlane"
brew "git"
brew "git-extras"
brew "gnupg"
brew "graphviz"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "jid"
brew "kubernetes-cli"
brew "nmap"
brew "ncdu"
brew "openssl"
brew "pandoc"
brew "scmpuff"
brew "shellcheck"
brew "speedtest_cli"
brew "streamlink"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim", args: ["--override-system-vi"]
brew "wget", args: ["--with-iri"]
brew "yarn", args: ["without-node"]
brew "youtube-dl"
brew "zsh-completions"

# Applications
cask_args appdir: "/Applications"
cask "alfred"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "figma"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "macdown"
cask "iina"
cask "notable"
cask "ngrok"
cask "notion"
cask "postman"
cask "skype"
cask "slack"
cask "sequel-pro"
cask "Rectangle"
cask "the-unarchiver"
cask "caskroom/versions/google-chrome-canary"
cask "visual-studio-code"
