tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

# Programming languages related
brew "fnm" # Fast and simple Node.js version manager
brew "lua"
brew "ruby"
brew "rbenv"
brew "chruby"
brew "ruby-install"
brew "python"
brew "pipenv"
brew "pyenv"
brew "node"
brew "go"
brew "rust"
# brew "k9s"
# brew "kubefwd"
# brew "android-studio"
# brew "kotlin"
# brew "scala"
# brew "sbt"
# brew "svn"

# AWS releated
brew "awscli"
brew "s3cmd"

brew "ripgrep"
brew "autojump"
brew "asciinema"
brew "bash"
brew "bat"
brew "gpg"
brew "caddy"
brew "coreutils"
brew "checkbashisms"
brew "diff-so-fancy"
brew "eza"
brew "fd"
brew "fzf"
brew "fortune"
brew "git"
brew "git-extras"
brew "gnupg"
brew "graphviz"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "mqttui"
brew "nmap"
brew "ncdu"
brew "openssl"
brew "scmpuff"
brew "streamlink"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "websocat"
brew "yarn"
brew "zsh-completions"

# Font
cask "font-jetbrains-mono-nerd-font"
cask "font-pt-mono"
cask "font-source-code-pro"

# Applications
cask_args appdir: "/Applications"
cask "dropbox"
cask "docker"
cask "firefox"
cask "figma"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "iterm2"
cask "iina"
cask "vlc"
cask "notion"
cask "postman"
cask "raycast"
cask "slack"
cask "sf-symbols"
cask "tableplus"
cask "the-unarchiver"
cask "homebrew/cask-versions/google-chrome-canary"
cask "ghostty"
cask "visual-studio-code"
cask "zed"
cask "inkscape"
cask "josm"
